---
kind: property
id: P:Autodesk.Revit.DB.View.Outline
zh: 视图
source: html/43a99f7c-6eb1-efb9-6aff-9540c434f8f2.htm
---
# Autodesk.Revit.DB.View.Outline Property

**中文**: 视图

The bounds of the view in paper space (in feet).

## Syntax (C#)
```csharp
public BoundingBoxUV Outline { get; }
```

## Remarks
Returns all zeros for empty views.